zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW716C/MCXW716C_COMMON.h
/* XCVR_ZBDEMOD - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE                        (0x58A07500u)
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE_NS                     (0x48A07500u)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD                             ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD_NS                          ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE_NS)
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS                  { XCVR_ZBDEMOD_BASE }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS                   { XCVR_ZBDEMOD }
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS_NS               { XCVR_ZBDEMOD_BASE_NS }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS_NS                { XCVR_ZBDEMOD_NS }
#else
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE                        (0x48A07500u)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD                             ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE)
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS                  { XCVR_ZBDEMOD_BASE }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS                   { XCVR_ZBDEMOD }
#endif

/* ZLL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ZLL base address */
  #define ZLL_BASE                                 (0x58A01000u)
  /** Peripheral ZLL base address */
  #define ZLL_BASE_NS                              (0x48A01000u)
  /** Peripheral ZLL base pointer */
  #define ZLL                                      ((ZLL_Type *)ZLL_BASE)
  /** Peripheral ZLL base pointer */
  #define ZLL_NS                                   ((ZLL_Type *)ZLL_BASE_NS)
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS                           { ZLL_BASE }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS                            { ZLL }
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS_NS                        { ZLL_BASE_NS }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS_NS                         { ZLL_NS }
#else
  /** Peripheral ZLL base address */
  #define ZLL_BASE                                 (0x48A01000u)
  /** Peripheral ZLL base pointer */
  #define ZLL                                      ((ZLL_Type *)ZLL_BASE)
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS                           { ZLL_BASE }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS                            { ZLL }
#endif

/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field##_SHIFT)) & (field##_MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field##_MASK)) >> (field##_SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define RADIO_IS_GEN_4P5 (1)
#define NXP_RADIO_GEN (450)
#ifndef MCXW71_core0_SERIES
#define MCXW71_core0_SERIES
#endif

/*! @brief define LTC0 from LTC. */
#define LTC0 LTC

#define PLATFORM_CTCM0_IDX 0U
#define PLATFORM_CTCM1_IDX 1U
#define PLATFORM_STCM0_IDX 2U
#define PLATFORM_STCM1_IDX 3U
#define PLATFORM_STCM2_IDX 4U
#define PLATFORM_STCM3_IDX 5U
#define PLATFORM_STCM4_IDX 6U
#define PLATFORM_STCM5_IDX 7U

#define PLATFORM_CTCM0_START_ADDR (0x04000000U)
#define PLATFORM_CTCM0_END_ADDR   (0x04001FFFU)
#define PLATFORM_CTCM1_START_ADDR (0x04002000U)
#define PLATFORM_CTCM1_END_ADDR   (0x04003FFFU)
#define PLATFORM_STCM0_START_ADDR (0x20000000U)
#define PLATFORM_STCM0_END_ADDR   (0x20003FFFU)
#define PLATFORM_STCM1_START_ADDR (0x20004000U)
#define PLATFORM_STCM1_END_ADDR   (0x20007FFFU)
#define PLATFORM_STCM2_START_ADDR (0x20008000U)
#define PLATFORM_STCM2_END_ADDR   (0x2000FFFFU)
#define PLATFORM_STCM3_START_ADDR (0x20010000U)
#define PLATFORM_STCM3_END_ADDR   (0x20017FFFU)
#define PLATFORM_STCM4_START_ADDR (0x20018000U)
#define PLATFORM_STCM4_END_ADDR   (0x20019FFFU)
#define PLATFORM_STCM5_START_ADDR (0x2001A000U)
#define PLATFORM_STCM5_END_ADDR   (0x2001BFFFU)

#define PLATFORM_BANK_START_ADDR                                                                                \
    PLATFORM_CTCM0_START_ADDR, PLATFORM_CTCM1_START_ADDR, PLATFORM_STCM0_START_ADDR, PLATFORM_STCM1_START_ADDR, \
        PLATFORM_STCM2_START_ADDR, PLATFORM_STCM3_START_ADDR, PLATFORM_STCM4_START_ADDR, PLATFORM_STCM5_START_ADDR

#define PLATFORM_BANK_END_ADDR                                                                          \
    PLATFORM_CTCM0_END_ADDR, PLATFORM_CTCM1_END_ADDR, PLATFORM_STCM0_END_ADDR, PLATFORM_STCM1_END_ADDR, \
        PLATFORM_STCM2_END_ADDR, PLATFORM_STCM3_END_ADDR, PLATFORM_STCM4_END_ADDR, PLATFORM_STCM5_END_ADDR

#define PLATFORM_BANK_IS_ECC TRUE, TRUE, TRUE, TRUE, TRUE, FALSE, FALSE, TRUE

#define PLATFORM_VBAT_LDORAM_IDX PLATFORM_STCM5_IDX

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MCXW716C_COMMON_H_ */

